Repository: ErHaWeb/partner_rating
Catalog: Resources/Private/Language/*.locallang_*.xlf
Languages: da, de

# partnerrating_pi1.title
source: Partner Rating
de: Partnerbewertung

# partnerrating_pi1.description
source: Plugin to provide a front-end form for departments to rate partners.
de: Plugin zur Bereitstellung eines Frontend-Formulars für Abteilungen zur Bewertung von Partnern.

# constants.customcategory.plugin.tx_partnerrating_pi1
source: Partner Rating
de: Partner-Bewertung

# constants.subcategory.fluidrootpaths
source: Fluid root paths
de: Fuid Root-Pfade

# constants.subcategory.resources
source: Resources
de: Ressourcen

# constants.subcategory.settings
source: Settings
de: Einstellungen

# constants.view.templateRootPath
source: Path to template root (FE)
de: Pfad zum Template Root-Pfad (FE)

# constants.view.partialRootPath
source: Path to template partials (FE)
de: Pfad zum Partial Root-Pfad (FE)

# constants.view.layoutRootPath
source: Path to template layouts (FE)
de: Pfad zum Layout Root-Pfad (FE)

# constants.settings.includeBootstrap
source: Include Bootstrap from CDN:If this option is "true" then Bootstrap 5 will be included via CDN from jsDelivr. This option should only be used for testing purposes. If you want to use Bootstrap 5 (the default framework of the Partner Rating template) for rendering, it is recommended to include it yourself via your site package and leave this option disabled.
de: Bootstrap von CDN einbinden:Wenn diese Option "true" ist, wird Bootstrap 5 über CDN von jsDelivr eingebunden. Diese Option sollte nur zu Testzwecken verwendet werden. Wenn Sie Bootstrap 5 (das Standard-Framework der Partner-Bewertungsvorlage) zum Rendern verwenden möchten, wird empfohlen, es selbst über Ihr Website-Paket einzubinden und diese Option deaktiviert zu lassen.

# constants.settings.cssFile
source: Path to CSS file (FE):CSS file that is used by default
de: Pfad zur CSS-Datei (FE):CSS-Datei, die standardmäßig verwendet wird

# constants.settings.javaScriptFile
source: Path to JavaScript file (FE):JavaScript file that is used by default
de: Pfad zur JavaScript-Datei (FE):JavaScript-Datei, die standardmäßig verwendet wird

# constants.settings.ratingValues
source: Rating Values:Comma separated list of integer values that can be selected for the rating.
de: Bewertungswerte:Durch Kommata getrennte Liste von Ganzzahlwerten, die für die Bewertung ausgewählt werden können.

# constants.settings.ratingReasonMinValue
source: Rating Reason Min. Value:If the selected rating exceeds this limit, then there is an obligation to select a reason.
de: Bewertung Grund Min. Wert:Wenn die gewählte Bewertung diesen Grenzwert überschreitet, muss ein Grund ausgewählt werden.

# constants.settings.keepMinOneSearchResult
source: Keep min. one search result:If this setting is `true`, then it is ensured that at least one result remains in the partner selection list, even if the entered string no longer leads to any results.
de: Mindestens ein Suchergebnis beibehalten:Ist diese Einstellung `true`, so wird sichergestellt, dass mindestens ein Ergebnis in der Partnerauswahlliste verbleibt, auch wenn die eingegebene Zeichenfolge zu keinem Ergebnis mehr führt.

# constants.settings.partnerLabelFields
source: Partner Label Fields:Comma-separated list of database fields to be used for forming the label of entries in the partner selection field. Fields that do not exist in the partner table are ignored.
de: Partnerbezeichnungsfelder:Durch Kommata getrennte Liste von Datenbankfeldern, die zur Bildung der Bezeichnung der Einträge im Partnerauswahlfeld verwendet werden sollen. Felder, die in der Partnertabelle nicht vorhanden sind, werden ignoriert.

# constants.settings.partnerLabelFieldSplitString
source: Partner Label Field Split String:String used between label fields that are defined by `partnerLabelFields`.
de: Trennzeichenkette für Partnerbezeichnungsfelder:Zeichenkette, die zwischen den durch `partnerLabelFields` definierten Partnerbezeichnungsfeldern verwendet wird.

# validation.reason
source: Please select a reason.
da: Vælg venligst en grund.
de: Bitte wählen Sie einen Bewertungsgrund aus.

# validation.partner
source: Please select a partner.
da: Vælg venligst en partner.
de: Bitte wählen Sie einen Partner.

# form.title
source: Rating Form
da: Bedømmelseformular
de: Bewertungsformular

# partner.searchPlaceholder
source: Number or name of the partner
da: Partnerens nummer eller navn
de: Nummer oder Name des Partners

# partner.searchTooltip
source: Enter partial words or partner numbers to find matching results more quickly.
da: Indtast delvise ord eller partnertal for at finde matchende resultater hurtigere.
de: Geben Sie Wortteile oder Nummer des Partners an, um passende Ergebnisse schneller zu finden.

# partner.choosePartner
source: Choose a Partner
da: Vælg en partner
de: Wähle einen Partner

# save.title
source: Rating saved!
da: Bedømmelse gemt!
de: Bewertung gespeichert!

# save.message
source: %1$s has been rated with a rating of %2$s.
da: %1$s er blevet bedømt med en bedømmelse på %2$s.
de: %1$s wurde bewertet mit der Note %2$s.

# reason.title
source: Rating Reason
da: Årsag til bedømmelse
de: Begründung

# reasons.title
source: Rating Reasons
da: Årsag til bedømmelser
de: Begründungen

# reasonText.title
source: Rating Reason Text
de: Bewertungsgrund (Freitext)

# rating.title
source: Rating
da: Bedømmelse
de: Bewertung

# reason.none
source: No reason selected
da: Ingen årsag valgt
de: Kein Bewertungsgrund ausgewählt

# reasonText.title
source: Rating Reason (free text)
da: Bedømmelsesbegrundelse (fri tekst)
de: Bewertungsgrund (Freitext)

# submit
source: Save Rating
da: Gem bedømmelse
de: Bewertung speichern

source: ← back
da: ← tilbage
de: ← zurück
