Repository: ErHaWeb/partner_rating
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de

# tx_partnerrating_domain_model_partner.title
source: Title
de: Titel

# tx_partnerrating_domain_model_partner.title.description
source: By entering the name of the partner, a partner can be found in the evaluation sheet.
de: Durch Eingabe des Namens des Partners kann ein Partner im Bewertungsbogen gefunden werden.

# tx_partnerrating_domain_model_partner.partner_nr.description
source: By entering the partner number, a partner can be found in the evaluation sheet.
de: Über die Eingabe der Partnernummer kann ein Partner im Bewertungsbogen gefunden werden.

# tx_partnerrating_domain_model_rating
source: Rating
de: Bewertung

# tx_partnerrating_domain_model_rating.rate_value
source: Rate Value
de: Bewertungswert

# tx_partnerrating_domain_model_rating.rate_value.description
source: Valuation value assigned by a department
de: Von einer Abteilung zugewiesener Bewertungswert

# tx_partnerrating_domain_model_rating.partner.description
source: Partner who received this rating
de: Partner, die diese Bewertung erhalten haben

# tx_partnerrating_domain_model_rating.reason
source: Rating Reason
de: Bewertungsgrund

# tx_partnerrating_domain_model_rating.reason_text
source: Rating Reason Text
de: Begründungstext

# tx_partnerrating_domain_model_rating.reason_text.description
source: Justification for the department's rating in free text form
de: Begründung für die Bewertung durch die Abteilung in freier Textform

# tx_partnerrating_domain_model_rating.reason.description
source: Reason for rating given by the department
de: Von der Abteilung angegebener Bewertungsgrund

# tx_partnerrating_domain_model_rating.department
source: Department
de: Abteilung

# tx_partnerrating_domain_model_rating.department.description
source: Department that gave the rating
de: Abteilung, die die Bewertung abgegeben hat

# tx_partnerrating_domain_model_reason.department
source: Department
de: Abteilung

# tx_partnerrating_domain_model_reason.department.description
source: Department to which this reason is available for selection in the rating form
de: Abteilung, der dieser Grund im Bewertungsformular zur Auswahl steht

# tx_partnerrating_domain_model_reason
source: Rating Reason
de: Bewertungsgrund

# tx_partnerrating_domain_model_reason.description
source: Description
de: Beschreibung

# tx_partnerrating_domain_model_reason.title
source: Title
de: Titel

# tx_partnerrating_domain_model_reason.title.description
source: Heading of the rating reason
de: Überschrift des Bewertungsgrundes

# tx_partnerrating_domain_model_reason.description.description
source: Complete formulation of the rating reason
de: Vollständige Formulierung des Grundes für die Bewertung

# tx_partnerrating_domain_model_department
source: Department
de: Abteilung

# tx_partnerrating_domain_model_department.title
source: Title
de: Titel

# tx_partnerrating_domain_model_department.title.description
source: Name of the department used in the list output of departments by the plugin.
de: Name der Abteilung, der in der Listenausgabe der Abteilungen durch das Plugin verwendet wird.
